
public class Task1 {
    public static void main(String[] args) {

        //Задание 1: вывести строку, разделённую на строки, в консоль
        System.out.println("\"Your time is limited\n  so don't waste it\n   living someone else's life\"\n    Steve Jobs");

    }
}